org/_posts/2016-03-28-fundamental-theorem-calculus.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: "Fundamental Theorem of Calculus"
date: 2016-04-01
comments: true
theorems: true
tags: theorems maths
excerpt: A short description of the fundamental theorem of calculus.
---
#+END_HTML

The *fundamental theorem of calculus* can be broken down into 2
different parts:

- *1st part: 1st fundamental theorem of calculus* states that if $f$
  is /continuous/ on the /closed interval/ $[a, b]$ and $F$ is the
  /indefinite integral/ of $f$ on $[a, b],$ then $\int_{a}^{b} f(x) dx
  = F(b) - F(a)$. In other words the /definite integration/ of a
  function is related to its /antiderivative/, and can be reversed by
  /differentiation/. This guarantees the existence of /antiderivatives/
  for /continuous functions/.


- *Proof:*

  $F(x) = \int_{a}^{x}f(t)dt$

  $\forall\; x_{1}, x_{1}+\Delta x \in [a, b]$,

  we have

  $F(x_{1}) = \int_{a}^{x_{1}} f(t) d(t)$ &

  $F(x_{1}+\Delta x) = \int_{a}^{x_{1}+\Delta x} f(t) dt$

  \begin{equation}
  F(x_{1} + \Delta x) - F(x_{1}) = \int_{a}^{x_{1} + \Delta x} f(t) dt
  \end{equation}


- *2nd part: 2nd fundamental theorem of calculus* states that if $F$
  is defined by $F(x) = \int_{a}^{x}f(t) dt$ then $F'(x) = f(x)$ at
  each point on the open interval $I$ iff $f$ is a /continuous
  function/ on that open interval $I$ and letting $a$ be any point in
  $I$. In other words the /definite integral/ of a function can be
  computed by using any one of its infinitely-many /antiderivatives/.
