_posts/2016-03-28-fundamental-theorem-calculus.html
---
layout: post
title: "Fundamental Theorem of Calculus"
date: 2016-04-01
comments: true
theorems: true
tags: theorems maths
excerpt: A short description of the fundamental theorem of calculus.
---

<p>
The <b>fundamental theorem of calculus</b> can be broken down into 2
different parts:
</p>

<ul class="org-ul">
<li><b>1st part: 1st fundamental theorem of calculus</b> states that if \(f\)
is <i>continuous</i> on the <i>closed interval</i> \([a, b]\) and \(F\) is the
<i>indefinite integral</i> of \(f\) on $[a, b],$ then \(\int_{a}^{b} f(x) dx
  = F(b) - F(a)\). In other words the <i>definite integration</i> of a
function is related to its <i>antiderivative</i>, and can be reversed by
<i>differentiation</i>. This guarantees the existence of <i>antiderivatives</i>
for <i>continuous functions</i>.</li>
</ul>


<ul class="org-ul">
<li><b>Proof:</b></li>
</ul>


<p>
\(F(x) = \int_{a}^{x}f(t)dt\) \(\forall x_{1}, x_{1}+\Delta x_{1} \in
  [a, b]\), we have \(F(x_{1}) = \int_{a}^{x_{1}} f(t) d(t)\) &amp;
\(F(x_{1}+\Delta x) = \int_{a}^{x_{1}+\Delta x} f(t) dt\)
</p>


<ul class="org-ul">
<li><b>2nd part: 2nd fundamental theorem of calculus</b> states that if \(F\)
is defined by \(F(x) = \int_{a}^{x}f(t) dt\) then \(F'(x) = f(x)\) at
each point on the open interval \(I\) iff \(f\) is a <i>continuous
function</i> on that open interval \(I\) and letting \(a\) be any point in
\(I\). In other words the <i>definite integral</i> of a function can be
computed by using any one of its infinitely-many <i>antiderivatives</i>.</li>
</ul>
